#============================================
#PYTHON PROJECT 2026
#Διαχείριση σχολικών λεσχών
#============================================

#--------------------------------------------
#1.ΣΤΑΘΕΡΑ ΣΤΟΙΧΕΙΑ ΛΕΣΧΩΝ ΜΕ TUPLES
#--------------------------------------------
robotics_info=("Ρομποτική","κ.Παπαδόπουλος","Δευτέρα")
theater_info=("Θέατρο","κ.Ιωάννου","Τρίτη")
music_info=("Μουσική","κ.Δημητρίου","Τετάρτη");
sports_info=("Αθλητισμός","κ.Κωνσταντίνου","Πέμπτη")

#--------------------------------------------
#2.ΣΥΝΟΛΑ ΜΑΘΗΤΩΝ ΑΝΑ ΛΕΣΧΗ
#--------------------------------------------
robotics_club={"Άννα","Γιάννης","Μαρία"}
theater_club={"Μαρία","Νίκος","Ελένη"}
music_club={"Πέτρος","Άννα","Σοφία"}
sports_club={"Γιάννης","Κώστας","Ελένη"}

#--------------------------------------------
#3.ΛΙΣΤΕΣ ΟΡΓΑΝΩΣΗΣ
#--------------------------------------------
club_infos=[robotics_info,theater_info,music_info,sports_info]
club_students=[robotics_club,theater_club,music_club,sports_club]

#--------------------------------------------
#4.ΜΕΝΟΥ ΕΠΙΛΟΓΩΝ
#--------------------------------------------
while True:
    print("\nΜΕΝΟΥ ΔΙΑΧΕΙΡΙΣΗΣ ΛΕΣΧΩΝ\n")
    print("1. Εμφάνιση όλων των λεσχών")
    print("robotics, theater, music, sports")
    print("2. Εμφάνιση στοιχείων μιας λέσχης")
    print(robotics_info)
    print("3. Εμφάνιση μαθητών μιας λέσχης")
    print(f"Τα μέλη της ρομποτικής είναι:{robotics_club}")
    print("4. Αναζήτηση μαθητή")

    print("5. Προσθήκη μαθητή")
    print("6. Διαγραφή μαθητή")
    print("7. Εμφάνιση όλων των μοναδικών μαθητών")
    print("8. Εμφάνιση κοινών μαθητών δύο λεσχών")
    print("9. Εμφάνιση μαθητών μόνο μιας λέσχης")
    print("10. Έξοδος")

    choice = input("Δώστε επιλογή:").strip()
    
    break





















